bmTest01/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 convertToMeters 1;

//- number of mesh
nX 40;
nY 20;
nZ 4;

//- minimum coordinate [m]
_xMin 0.0;
_yMin 0.0;
_zMin 0.0;

//- minimum coordinate [m]
_xMax 0.1;
_yMax 0.05;
_zMax 0.01;

vertices 
(
    ($_xMin $_yMin $_zMin)  // 0
    ($_xMax $_yMin $_zMin)  // 1
    ($_xMax $_yMax $_zMin)  // 2
    ($_xMin $_yMax $_zMin)  // 3
    
    ($_xMin $_yMin $_zMax)  // 4
    ($_xMax $_yMin $_zMax)  // 5
    ($_xMax $_yMax $_zMax)  // 6
    ($_xMin $_yMax $_zMax)  // 7
);

blocks
(
    hex (0 1 2 3  4 5 6 7) ($nX $nY $nZ) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xMin
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    xMax
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    yMin
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    yMax
    {
        type wall;
        faces
        (
            (7 6 2 3)
        );
    }
    zMin
    {
        type cyclic;
        neighbourPatch zMax;
        faces
        (
            (3 2 1 0)
        );
    }
    zMax
    {
        type cyclic;
        neighbourPatch zMin;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //


