bmTest01/constant/polyMesh/blockMeshDict_simple
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 convertToMeters 1;

vertices 
(
    (0.0 0.0  0.0)  // 0
    (0.1 0.0  0.0)  // 1
    (0.1 0.05 0.0)  // 2
    (0.0 0.05 0.0)  // 3
    
    (0.0 0.0  0.01) // 4
    (0.1 0.0  0.01) // 5
    (0.1 0.05 0.01) // 6
    (0.0 0.05 0.01) // 7
);

blocks
(
    hex (0 1 2 3  4 5 6 7) (40 20 4) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xMin
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    xMax
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    yMin
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    yMax
    {
        type wall;
        faces
        (
            (7 6 2 3)
        );
    }
    zMin
    {
        type cyclic;
        neighbourPatch zMax;
        faces
        (
            (3 2 1 0)
        );
    }
    zMax
    {
        type cyclic;
        neighbourPatch zMin;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //


